tap "axodotdev/tap"
tap "charmbracelet/tap"
tap "dotzenith/tap"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jdxcode/tap"
tap "koekeishiya/formulae"
tap "localsend/localsend"
tap "majd/repo"
tap "pkgxdev/made"
tap "spicetify/tap"
tap "wez/wezterm"
brew "xz"
brew "assimp"
brew "atuin"
brew "oniguruma"
brew "bat"
brew "bottom"
brew "sqlite"
brew "bpytop"
brew "glib"
brew "libx11"
brew "libxrender"
brew "libmpc"
brew "gcc"
brew "clang-format"
brew "coreutils"
brew "cowsay"
brew "curl"
brew "dust"
brew "fd"
brew "libass"
brew "mbedtls"
brew "librist"
brew "libsndfile"
brew "sdl2"
brew "ffmpeg"
brew "numpy"
brew "ffmpegthumbnailer"
brew "fontforge"
brew "fzf"
brew "gdb"
brew "git"
brew "git-delta"
brew "glow"
brew "go"
brew "guile"
brew "helix"
brew "htop"
brew "httpie"
brew "hugo"
brew "hyperfine"
brew "jq"
brew "lazygit"
brew "lolcat"
brew "lsd"
brew "luajit"
brew "mise"
brew "moreutils"
brew "yt-dlp"
brew "mpv"
brew "neofetch"
brew "neovim"
brew "node"
brew "nss"
brew "opencv"
brew "openjdk"
brew "pandoc"
brew "pfetch"
brew "pipes-sh"
brew "poppler"
brew "python@3.10"
brew "python@3.11"
brew "qemu"
brew "ranger"
brew "ripgrep"
brew "sccache"
brew "sd"
brew "speedtest-cli"
brew "spicetify-cli"
brew "starship"
brew "tlrc"
brew "tmux"
brew "ttyd", args: ["HEAD"]
brew "typst"
brew "unar"
brew "uv"
brew "yazi"
brew "zellij"
brew "zsh"
brew "axodotdev/tap/cargo-dist"
brew "charmbracelet/tap/freeze"
brew "charmbracelet/tap/vhs"
brew "dotzenith/tap/lovesay"
brew "dotzenith/tap/spotifetch"
brew "dotzenith/tap/the-septa-times"
brew "felixkratz/formulae/borders"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
cask "alfred"
cask "android-platform-tools"
cask "appcleaner"
cask "autodesk-fusion"
cask "calibre"
cask "discord"
cask "docker"
cask "firefox"
cask "font-fontawesome"
cask "font-iosevka"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "iina"
cask "joplin"
cask "karabiner-elements"
cask "keycastr"
cask "kitty"
cask "linearmouse"
cask "localsend"
cask "macs-fan-control"
cask "monero-wallet"
cask "mullvadvpn"
cask "nextcloud"
cask "notion"
cask "numi"
cask "obs"
cask "raspberry-pi-imager"
cask "rectangle"
cask "spotify"
cask "stremio"
cask "tor-browser"
cask "ubersicht"
cask "ultimaker-cura"
cask "utm"
cask "via"
cask "virtualbox"
cask "wezterm"
cask "wireshark"
cask "zed"
